post/Games/mc/红石学习笔记.org
#+TITLE: 红石学习笔记
#+AUTHOR: QwQ
#+DATE: <2024-11-23 Sat 18:58>

#+SETUPFILE: ../../../setup.setup

* 基础知识
** 时间单位
- gt = game time (tick) (游戏时间)
- rt = redstone tick (红石刻)
- 1s = 10rt = 20gt
  1rt = 1gt
** 红石组件(部分内容来自MC百科)
*** 红石中继器
#+begin_src text
  红石中继器（Redstone Repeater）在红石电路中是用于“中继”并放大红石信号、“锁存”信号状态或者阻止信号倒流的方块。
#+end_src
有1~4rt的延迟
*** 红石比较器
#+begin_src text
  红石比较器（Redstone Comparator）是能使红石信号保持、比较、作差或检测特定数据值（主要是容器装载量）的红石元件方块。
#+end_src
红石比较器具有两个模式:比较模式和减法模式。默认情况下是比较模式，当输出向火把亮
起时则为减法模式，具体工作情况如下:

- 比较模式:将正面输入与两旁的输入信号强度相比较（两边同时有输入时强度哪边大选哪
  边进行运算），倘若正面输入比侧面的大，则有输出（强度为正面输入时的强度），否则
  无。
- 减法模式:将正面输入减去侧面输入的信号强度作为最终信号强度的输出

无论在哪个模式下，红石比较器都能够检测容器内的物品数量并输出不等的信号强度

有1rt的延迟
* Singal Clock
** Time table
| rt  | event      |
|-----+------------|
| 1rt | toogle     |
| 1rt | fire light |
| 4rt | wait       |
| 1rt | fire off   |
| 4rt | wiat       |
| 1rt | fire light |
| ... | ...        |

