post/其他/游戏/mc/红石学习笔记.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<!-- 2025-01-23 四 11:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>红石学习笔记</title>
<meta name="author" content="QwQ 不要在意我的头像QwQ" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/theme/main.css"/>
<link rel="shortcut icon" href="/img/icon.jpg">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">红石学习笔记</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc166ead">1. 基础知识</a>
<ul>
<li><a href="#orge42f00f">1.1. 时间单位</a></li>
<li><a href="#org012825f">1.2. 红石组件(部分内容来自MC百科)</a>
<ul>
<li><a href="#org7eeed7d">1.2.1. 红石中继器</a></li>
<li><a href="#org905833a">1.2.2. 红石比较器</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc67bfd9">2. Singal Clock</a>
<ul>
<li><a href="#orgb360d3d">2.1. Time table</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc166ead" class="outline-2">
<h2 id="orgc166ead"><span class="section-number-2">1.</span> 基础知识</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge42f00f" class="outline-3">
<h3 id="orge42f00f"><span class="section-number-3">1.1.</span> 时间单位</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>gt = game time (tick) (游戏时间)</li>
<li>rt = redstone tick (红石刻)</li>
<li>1s = 10rt = 20gt
1rt = 1gt</li>
</ul>
</div>
</div>
<div id="outline-container-org012825f" class="outline-3">
<h3 id="org012825f"><span class="section-number-3">1.2.</span> 红石组件(部分内容来自MC百科)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org7eeed7d" class="outline-4">
<h4 id="org7eeed7d"><span class="section-number-4">1.2.1.</span> 红石中继器</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-text">&#32418;&#30707;&#20013;&#32487;&#22120;&#65288;Redstone Repeater&#65289;&#22312;&#32418;&#30707;&#30005;&#36335;&#20013;&#26159;&#29992;&#20110;&#8220;&#20013;&#32487;&#8221;&#24182;&#25918;&#22823;&#32418;&#30707;&#20449;&#21495;&#12289;&#8220;&#38145;&#23384;&#8221;&#20449;&#21495;&#29366;&#24577;&#25110;&#32773;&#38459;&#27490;&#20449;&#21495;&#20498;&#27969;&#30340;&#26041;&#22359;&#12290;
</pre>
</div>
<p>
有1~4rt的延迟
</p>
</div>
</div>
<div id="outline-container-org905833a" class="outline-4">
<h4 id="org905833a"><span class="section-number-4">1.2.2.</span> 红石比较器</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-text">&#32418;&#30707;&#27604;&#36739;&#22120;&#65288;Redstone Comparator&#65289;&#26159;&#33021;&#20351;&#32418;&#30707;&#20449;&#21495;&#20445;&#25345;&#12289;&#27604;&#36739;&#12289;&#20316;&#24046;&#25110;&#26816;&#27979;&#29305;&#23450;&#25968;&#25454;&#20540;&#65288;&#20027;&#35201;&#26159;&#23481;&#22120;&#35013;&#36733;&#37327;&#65289;&#30340;&#32418;&#30707;&#20803;&#20214;&#26041;&#22359;&#12290;
</pre>
</div>
<p>
红石比较器具有两个模式:比较模式和减法模式。默认情况下是比较模式，当输出向火把亮
起时则为减法模式，具体工作情况如下:
</p>

<ul class="org-ul">
<li>比较模式:将正面输入与两旁的输入信号强度相比较（两边同时有输入时强度哪边大选哪
边进行运算），倘若正面输入比侧面的大，则有输出（强度为正面输入时的强度），否则
无。</li>
<li>减法模式:将正面输入减去侧面输入的信号强度作为最终信号强度的输出</li>
</ul>

<p>
无论在哪个模式下，红石比较器都能够检测容器内的物品数量并输出不等的信号强度
</p>

<p>
有1rt的延迟
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc67bfd9" class="outline-2">
<h2 id="orgc67bfd9"><span class="section-number-2">2.</span> Singal Clock</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb360d3d" class="outline-3">
<h3 id="orgb360d3d"><span class="section-number-3">2.1.</span> Time table</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">rt</th>
<th scope="col" class="org-left">event</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1rt</td>
<td class="org-left">toogle</td>
</tr>

<tr>
<td class="org-left">1rt</td>
<td class="org-left">fire light</td>
</tr>

<tr>
<td class="org-left">4rt</td>
<td class="org-left">wait</td>
</tr>

<tr>
<td class="org-left">1rt</td>
<td class="org-left">fire off</td>
</tr>

<tr>
<td class="org-left">4rt</td>
<td class="org-left">wiat</td>
</tr>

<tr>
<td class="org-left">1rt</td>
<td class="org-left">fire light</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-11-23 六 18:58</p>
<p class="author">Author: QwQ 不要在意我的头像QwQ</p>
<p class="date">Created: 2025-01-23 四 11:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
